package com.company.classes.simple_classes.Task6;

public class Main {
    //6. Составьте описание класса для представления времени.
    // Предусмотрте возможности установки времени и изменения его отдельных полей (час, минута, секунда)
    // с проверкой допустимости вводимых значений.
    // В случае недопустимых значений полей поле устанавливается в значение 0.
    // Создать методы изменения времени на заданное количество часов, минут и секунд.

    public static void main(String[] args) {
        Timer t = new Timer();
        t.printTimer();
        t.rollHour(5);
        t.printTimer();
        t.setHour(60);
        t.printTimer();
    }
}
